7767517
172 183
Input            input                    0 1 input 0=56 1=56 2=3
Convolution      329                      1 1 input 329 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        330                      1 1 329 330 0=32
Clip             331                      1 1 330 331 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 332                      1 1 331 332 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        333                      1 1 332 333 0=32
Clip             334                      1 1 333 334 0=0.000000e+00 1=6.000000e+00
Convolution      335                      1 1 334 335 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        336                      1 1 335 336 0=16
Convolution      337                      1 1 336 337 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        338                      1 1 337 338 0=96
Clip             339                      1 1 338 339 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 340                      1 1 339 340 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        341                      1 1 340 341 0=96
Clip             342                      1 1 341 342 0=0.000000e+00 1=6.000000e+00
Convolution      343                      1 1 342 343 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        344                      1 1 343 344 0=24
Split            splitncnn_0              1 2 344 344_splitncnn_0 344_splitncnn_1
Convolution      345                      1 1 344_splitncnn_1 345 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        346                      1 1 345 346 0=144
Clip             347                      1 1 346 347 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 348                      1 1 347 348 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        349                      1 1 348 349 0=144
Clip             350                      1 1 349 350 0=0.000000e+00 1=6.000000e+00
Convolution      351                      1 1 350 351 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        352                      1 1 351 352 0=24
BinaryOp         353                      2 1 344_splitncnn_0 352 353 0=0
Convolution      354                      1 1 353 354 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        355                      1 1 354 355 0=144
Clip             356                      1 1 355 356 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 357                      1 1 356 357 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        358                      1 1 357 358 0=144
Clip             359                      1 1 358 359 0=0.000000e+00 1=6.000000e+00
Convolution      360                      1 1 359 360 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        361                      1 1 360 361 0=32
Split            splitncnn_1              1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution      362                      1 1 361_splitncnn_1 362 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        363                      1 1 362 363 0=192
Clip             364                      1 1 363 364 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 365                      1 1 364 365 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        366                      1 1 365 366 0=192
Clip             367                      1 1 366 367 0=0.000000e+00 1=6.000000e+00
Convolution      368                      1 1 367 368 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        369                      1 1 368 369 0=32
BinaryOp         370                      2 1 361_splitncnn_0 369 370 0=0
Split            splitncnn_2              1 2 370 370_splitncnn_0 370_splitncnn_1
Convolution      371                      1 1 370_splitncnn_1 371 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        372                      1 1 371 372 0=192
Clip             373                      1 1 372 373 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 374                      1 1 373 374 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        375                      1 1 374 375 0=192
Clip             376                      1 1 375 376 0=0.000000e+00 1=6.000000e+00
Convolution      377                      1 1 376 377 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        378                      1 1 377 378 0=32
BinaryOp         379                      2 1 370_splitncnn_0 378 379 0=0
Convolution      380                      1 1 379 380 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        381                      1 1 380 381 0=192
Clip             382                      1 1 381 382 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 383                      1 1 382 383 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        384                      1 1 383 384 0=192
Clip             385                      1 1 384 385 0=0.000000e+00 1=6.000000e+00
Convolution      386                      1 1 385 386 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        387                      1 1 386 387 0=64
Split            splitncnn_3              1 2 387 387_splitncnn_0 387_splitncnn_1
Convolution      388                      1 1 387_splitncnn_1 388 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        389                      1 1 388 389 0=384
Clip             390                      1 1 389 390 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 391                      1 1 390 391 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        392                      1 1 391 392 0=384
Clip             393                      1 1 392 393 0=0.000000e+00 1=6.000000e+00
Convolution      394                      1 1 393 394 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        395                      1 1 394 395 0=64
BinaryOp         396                      2 1 387_splitncnn_0 395 396 0=0
Split            splitncnn_4              1 2 396 396_splitncnn_0 396_splitncnn_1
Convolution      397                      1 1 396_splitncnn_1 397 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        398                      1 1 397 398 0=384
Clip             399                      1 1 398 399 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 400                      1 1 399 400 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        401                      1 1 400 401 0=384
Clip             402                      1 1 401 402 0=0.000000e+00 1=6.000000e+00
Convolution      403                      1 1 402 403 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        404                      1 1 403 404 0=64
BinaryOp         405                      2 1 396_splitncnn_0 404 405 0=0
Split            splitncnn_5              1 2 405 405_splitncnn_0 405_splitncnn_1
Convolution      406                      1 1 405_splitncnn_1 406 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        407                      1 1 406 407 0=384
Clip             408                      1 1 407 408 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 409                      1 1 408 409 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        410                      1 1 409 410 0=384
Clip             411                      1 1 410 411 0=0.000000e+00 1=6.000000e+00
Convolution      412                      1 1 411 412 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        413                      1 1 412 413 0=64
BinaryOp         414                      2 1 405_splitncnn_0 413 414 0=0
Convolution      415                      1 1 414 415 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        416                      1 1 415 416 0=384
Clip             417                      1 1 416 417 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 418                      1 1 417 418 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        419                      1 1 418 419 0=384
Clip             420                      1 1 419 420 0=0.000000e+00 1=6.000000e+00
Convolution      421                      1 1 420 421 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        422                      1 1 421 422 0=96
Split            splitncnn_6              1 2 422 422_splitncnn_0 422_splitncnn_1
Convolution      423                      1 1 422_splitncnn_1 423 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        424                      1 1 423 424 0=576
Clip             425                      1 1 424 425 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 426                      1 1 425 426 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        427                      1 1 426 427 0=576
Clip             428                      1 1 427 428 0=0.000000e+00 1=6.000000e+00
Convolution      429                      1 1 428 429 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        430                      1 1 429 430 0=96
BinaryOp         431                      2 1 422_splitncnn_0 430 431 0=0
Split            splitncnn_7              1 2 431 431_splitncnn_0 431_splitncnn_1
Convolution      432                      1 1 431_splitncnn_1 432 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        433                      1 1 432 433 0=576
Clip             434                      1 1 433 434 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 435                      1 1 434 435 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        436                      1 1 435 436 0=576
Clip             437                      1 1 436 437 0=0.000000e+00 1=6.000000e+00
Convolution      438                      1 1 437 438 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        439                      1 1 438 439 0=96
BinaryOp         440                      2 1 431_splitncnn_0 439 440 0=0
Convolution      441                      1 1 440 441 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        442                      1 1 441 442 0=576
Clip             443                      1 1 442 443 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 444                      1 1 443 444 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        445                      1 1 444 445 0=576
Clip             446                      1 1 445 446 0=0.000000e+00 1=6.000000e+00
Convolution      447                      1 1 446 447 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        448                      1 1 447 448 0=160
Split            splitncnn_8              1 2 448 448_splitncnn_0 448_splitncnn_1
Convolution      449                      1 1 448_splitncnn_1 449 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        450                      1 1 449 450 0=960
Clip             451                      1 1 450 451 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 452                      1 1 451 452 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        453                      1 1 452 453 0=960
Clip             454                      1 1 453 454 0=0.000000e+00 1=6.000000e+00
Convolution      455                      1 1 454 455 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        456                      1 1 455 456 0=160
BinaryOp         457                      2 1 448_splitncnn_0 456 457 0=0
Split            splitncnn_9              1 2 457 457_splitncnn_0 457_splitncnn_1
Convolution      458                      1 1 457_splitncnn_1 458 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        459                      1 1 458 459 0=960
Clip             460                      1 1 459 460 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 461                      1 1 460 461 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        462                      1 1 461 462 0=960
Clip             463                      1 1 462 463 0=0.000000e+00 1=6.000000e+00
Convolution      464                      1 1 463 464 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        465                      1 1 464 465 0=160
BinaryOp         466                      2 1 457_splitncnn_0 465 466 0=0
Convolution      467                      1 1 466 467 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        468                      1 1 467 468 0=960
Clip             469                      1 1 468 469 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 470                      1 1 469 470 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        471                      1 1 470 471 0=960
Clip             472                      1 1 471 472 0=0.000000e+00 1=6.000000e+00
Convolution      473                      1 1 472 473 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        474                      1 1 473 474 0=320
Convolution      475                      1 1 474 475 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=409600
BatchNorm        476                      1 1 475 476 0=1280
Clip             477                      1 1 476 477 0=0.000000e+00 1=6.000000e+00
Split            splitncnn_10             1 2 477 477_splitncnn_0 477_splitncnn_1
Pooling          478                      1 1 477_splitncnn_1 478 0=1 4=1
Convolution      479                      1 1 478 479 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=204800
ReLU             480                      1 1 479 480
Convolution      481                      1 1 480 481 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=204800
Sigmoid          482                      1 1 481 482
BinaryOp         483                      2 1 477_splitncnn_0 482 483 0=2
ConvolutionDepthWise 484                      1 1 483 484 0=1280 1=2 11=2 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=5120 7=1280
BatchNorm        485                      1 1 484 485 0=1280
Convolution      486                      1 1 485 486 0=136 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=174080
BatchNorm        487                      1 1 486 487 0=136
Reshape          output                   1 1 487 output 0=-1
